{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The autoreload extension is already loaded. To reload it, use:\n",
      "  %reload_ext autoreload\n",
      "The lab_black extension is already loaded. To reload it, use:\n",
      "  %reload_ext lab_black\n"
     ]
    }
   ],
   "source": [
    "%load_ext autoreload\n",
    "%load_ext lab_black\n",
    "\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "\n",
    "sys.path.append(\"..\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "\n",
    "import requests\n",
    "import pandas as pd\n",
    "from icecream import ic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "epigraphdb_api_url = \"https://api.epigraphdb.org\"\n",
    "transformers_url = \"http://localhost:8017\"\n",
    "models_api_url = \"http://localhost:8016\"\n",
    "neural_api_url = \"http://localhost:28015\"\n",
    "for _ in [epigraphdb_api_url, transformers_url, models_api_url, neural_api_url]:\n",
    "    r = requests.get(f\"{_}/ping\")\n",
    "    assert r.json()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "entity_name = \"Rare hyperthyroidism\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>name</th>\n",
       "      <th>text</th>\n",
       "      <th>score</th>\n",
       "      <th>meta_node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_181399</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>rare hyperthyroidism</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_181396</td>\n",
       "      <td>Rare hypothyroidism</td>\n",
       "      <td>rare hypothyroidism</td>\n",
       "      <td>0.938469</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.ebi.ac.uk/efo/EFO_0009189</td>\n",
       "      <td>Hyperthyroidism</td>\n",
       "      <td>hyperthyroidism</td>\n",
       "      <td>0.798496</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.ebi.ac.uk/efo/EFO_0009190</td>\n",
       "      <td>Thyrotoxicosis</td>\n",
       "      <td>thyrotoxicosis</td>\n",
       "      <td>0.773087</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0021136</td>\n",
       "      <td>rare</td>\n",
       "      <td>rare</td>\n",
       "      <td>0.761760</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_181431</td>\n",
       "      <td>Rare hypolipidemia</td>\n",
       "      <td>rare hypolipidemia</td>\n",
       "      <td>0.753467</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0019304</td>\n",
       "      <td>rare photodermatosis</td>\n",
       "      <td>rare photodermatosis</td>\n",
       "      <td>0.743852</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_181422</td>\n",
       "      <td>Rare hyperlipidemia</td>\n",
       "      <td>rare hyperlipidemia</td>\n",
       "      <td>0.739618</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_183631</td>\n",
       "      <td>Rare genetic thyroid disease</td>\n",
       "      <td>rare genetic thyroid disease</td>\n",
       "      <td>0.732493</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0019859</td>\n",
       "      <td>congenital thyroid malformation without hypoth...</td>\n",
       "      <td>congenital thyroid malformation without hypoth...</td>\n",
       "      <td>0.713052</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_442</td>\n",
       "      <td>Congenital hypothyroidism</td>\n",
       "      <td>congenital hypothyroidism</td>\n",
       "      <td>0.710319</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0019061</td>\n",
       "      <td>rare parathyroid disease and phosphocalcic met...</td>\n",
       "      <td>rare parathyroid disease and phosphocalcic met...</td>\n",
       "      <td>0.703564</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_183637</td>\n",
       "      <td>Rare genetic adrenal disease</td>\n",
       "      <td>rare genetic adrenal disease</td>\n",
       "      <td>0.702605</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_98594</td>\n",
       "      <td>Rare eyebrow/eyelashes anomaly</td>\n",
       "      <td>rare eyebrow/eyelashe anomaly</td>\n",
       "      <td>0.700708</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>http://www.ebi.ac.uk/efo/EFO_0004705</td>\n",
       "      <td>hypothyroidism</td>\n",
       "      <td>hypothyroidism</td>\n",
       "      <td>0.699884</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0015792</td>\n",
       "      <td>transient congenital hypothyroidism</td>\n",
       "      <td>transient congenital hypothyroidism</td>\n",
       "      <td>0.699627</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_181368</td>\n",
       "      <td>Rare insulin-resistance syndrome</td>\n",
       "      <td>rare insulin-resistance syndrome</td>\n",
       "      <td>0.699579</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>http://purl.obolibrary.org/obo/HP_0008250</td>\n",
       "      <td>Infantile hypercalcemia</td>\n",
       "      <td>infantile hypercalcemia</td>\n",
       "      <td>0.697480</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0000212</td>\n",
       "      <td>hypercalcemia, infantile</td>\n",
       "      <td>hypercalcemia , infantile</td>\n",
       "      <td>0.696923</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>http://purl.obolibrary.org/obo/MONDO_0018627</td>\n",
       "      <td>ACTH-independent Cushing syndrome due to rare ...</td>\n",
       "      <td>acth-independent cushing syndrome due to rare ...</td>\n",
       "      <td>0.695731</td>\n",
       "      <td>Efo</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              id  \\\n",
       "0      http://www.orpha.net/ORDO/Orphanet_181399   \n",
       "1      http://www.orpha.net/ORDO/Orphanet_181396   \n",
       "2           http://www.ebi.ac.uk/efo/EFO_0009189   \n",
       "3           http://www.ebi.ac.uk/efo/EFO_0009190   \n",
       "4   http://purl.obolibrary.org/obo/MONDO_0021136   \n",
       "5      http://www.orpha.net/ORDO/Orphanet_181431   \n",
       "6   http://purl.obolibrary.org/obo/MONDO_0019304   \n",
       "7      http://www.orpha.net/ORDO/Orphanet_181422   \n",
       "8      http://www.orpha.net/ORDO/Orphanet_183631   \n",
       "9   http://purl.obolibrary.org/obo/MONDO_0019859   \n",
       "10        http://www.orpha.net/ORDO/Orphanet_442   \n",
       "11  http://purl.obolibrary.org/obo/MONDO_0019061   \n",
       "12     http://www.orpha.net/ORDO/Orphanet_183637   \n",
       "13      http://www.orpha.net/ORDO/Orphanet_98594   \n",
       "14          http://www.ebi.ac.uk/efo/EFO_0004705   \n",
       "15  http://purl.obolibrary.org/obo/MONDO_0015792   \n",
       "16     http://www.orpha.net/ORDO/Orphanet_181368   \n",
       "17     http://purl.obolibrary.org/obo/HP_0008250   \n",
       "18  http://purl.obolibrary.org/obo/MONDO_0000212   \n",
       "19  http://purl.obolibrary.org/obo/MONDO_0018627   \n",
       "\n",
       "                                                 name  \\\n",
       "0                                Rare hyperthyroidism   \n",
       "1                                 Rare hypothyroidism   \n",
       "2                                     Hyperthyroidism   \n",
       "3                                      Thyrotoxicosis   \n",
       "4                                                rare   \n",
       "5                                  Rare hypolipidemia   \n",
       "6                                rare photodermatosis   \n",
       "7                                 Rare hyperlipidemia   \n",
       "8                        Rare genetic thyroid disease   \n",
       "9   congenital thyroid malformation without hypoth...   \n",
       "10                          Congenital hypothyroidism   \n",
       "11  rare parathyroid disease and phosphocalcic met...   \n",
       "12                       Rare genetic adrenal disease   \n",
       "13                     Rare eyebrow/eyelashes anomaly   \n",
       "14                                     hypothyroidism   \n",
       "15                transient congenital hypothyroidism   \n",
       "16                   Rare insulin-resistance syndrome   \n",
       "17                            Infantile hypercalcemia   \n",
       "18                           hypercalcemia, infantile   \n",
       "19  ACTH-independent Cushing syndrome due to rare ...   \n",
       "\n",
       "                                                 text     score meta_node  \n",
       "0                                rare hyperthyroidism  1.000000       Efo  \n",
       "1                                 rare hypothyroidism  0.938469       Efo  \n",
       "2                                     hyperthyroidism  0.798496       Efo  \n",
       "3                                      thyrotoxicosis  0.773087       Efo  \n",
       "4                                                rare  0.761760       Efo  \n",
       "5                                  rare hypolipidemia  0.753467       Efo  \n",
       "6                                rare photodermatosis  0.743852       Efo  \n",
       "7                                 rare hyperlipidemia  0.739618       Efo  \n",
       "8                        rare genetic thyroid disease  0.732493       Efo  \n",
       "9   congenital thyroid malformation without hypoth...  0.713052       Efo  \n",
       "10                          congenital hypothyroidism  0.710319       Efo  \n",
       "11  rare parathyroid disease and phosphocalcic met...  0.703564       Efo  \n",
       "12                       rare genetic adrenal disease  0.702605       Efo  \n",
       "13                      rare eyebrow/eyelashe anomaly  0.700708       Efo  \n",
       "14                                     hypothyroidism  0.699884       Efo  \n",
       "15                transient congenital hypothyroidism  0.699627       Efo  \n",
       "16                   rare insulin-resistance syndrome  0.699579       Efo  \n",
       "17                            infantile hypercalcemia  0.697480       Efo  \n",
       "18                          hypercalcemia , infantile  0.696923       Efo  \n",
       "19  acth-independent cushing syndrome due to rare ...  0.695731       Efo  "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r = requests.get(\n",
    "    f\"{neural_api_url}/query/text\",\n",
    "    params={\"text\": entity_name, \"include_meta_nodes\": [\"Efo\"], \"limit\": 20},\n",
    ")\n",
    "r.raise_for_status()\n",
    "recommender_df = pd.DataFrame(r.json()[\"results\"])\n",
    "recommender_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "ic| r.json(): {'metadata': {'empty_results': False,\n",
      "                            'query': \"MATCH (n:Efo) WHERE n._name = 'Rare hyperthyroidism' \"\n",
      "                                     'RETURN n {._id, ._name}',\n",
      "                            'total_seconds': 0.008761},\n",
      "               'results': [{'n': {'_id': 'http://www.orpha.net/ORDO/Orphanet_181399',\n",
      "                                  '_name': 'Rare hyperthyroidism'}}]}\n",
      "ic| efo_id: 'http://www.orpha.net/ORDO/Orphanet_181399'\n",
      "ic| efo_name: 'Rare hyperthyroidism'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Rare hyperthyroidism'"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get entity's efo equivalent term, id and name\n",
    "query = \"MATCH (n:Efo) WHERE n._name = '{term}' RETURN n {{._id, ._name}}\".format(\n",
    "    term=entity_name\n",
    ")\n",
    "r = requests.post(f\"{epigraphdb_api_url}/cypher\", json={\"query\": query})\n",
    "r.raise_for_status()\n",
    "ic(r.json())\n",
    "results = r.json()[\"results\"]\n",
    "\n",
    "efo_id = results[0][\"n\"][\"_id\"]\n",
    "efo_name = results[0][\"n\"][\"_name\"]\n",
    "ic(efo_id)\n",
    "ic(efo_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "ic| parent_df:                                       efo_id                      efo_name  \\\n",
      "               0       http://www.ebi.ac.uk/efo/EFO_0009189               Hyperthyroidism   \n",
      "               1  http://www.orpha.net/ORDO/Orphanet_183631  Rare genetic thyroid disease   \n",
      "               \n",
      "                 node_type  \n",
      "               0    parent  \n",
      "               1    parent  \n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>efo_id</th>\n",
       "      <th>efo_name</th>\n",
       "      <th>node_type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_181399</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>self</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.ebi.ac.uk/efo/EFO_0009189</td>\n",
       "      <td>Hyperthyroidism</td>\n",
       "      <td>parent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_183631</td>\n",
       "      <td>Rare genetic thyroid disease</td>\n",
       "      <td>parent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_99819</td>\n",
       "      <td>Familial gestational hyperthyroidism</td>\n",
       "      <td>child</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_424</td>\n",
       "      <td>Familial hyperthyroidism due to mutations in T...</td>\n",
       "      <td>child</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_3221</td>\n",
       "      <td>Generalized resistance to thyroid hormone</td>\n",
       "      <td>child</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://www.orpha.net/ORDO/Orphanet_165994</td>\n",
       "      <td>Selective pituitary resistance to thyroid hormone</td>\n",
       "      <td>child</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      efo_id  \\\n",
       "0  http://www.orpha.net/ORDO/Orphanet_181399   \n",
       "0       http://www.ebi.ac.uk/efo/EFO_0009189   \n",
       "1  http://www.orpha.net/ORDO/Orphanet_183631   \n",
       "0   http://www.orpha.net/ORDO/Orphanet_99819   \n",
       "1     http://www.orpha.net/ORDO/Orphanet_424   \n",
       "2    http://www.orpha.net/ORDO/Orphanet_3221   \n",
       "3  http://www.orpha.net/ORDO/Orphanet_165994   \n",
       "\n",
       "                                            efo_name node_type  \n",
       "0                               Rare hyperthyroidism      self  \n",
       "0                                    Hyperthyroidism    parent  \n",
       "1                       Rare genetic thyroid disease    parent  \n",
       "0               Familial gestational hyperthyroidism     child  \n",
       "1  Familial hyperthyroidism due to mutations in T...     child  \n",
       "2          Generalized resistance to thyroid hormone     child  \n",
       "3  Selective pituitary resistance to thyroid hormone     child  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get efo term's parents and children\n",
    "query = \"\"\"\n",
    "    MATCH (n:Efo)<-[r:EFO_CHILD_OF]-(parent_efo:Efo)\n",
    "    WHERE n._id = '{efo_id}' AND n._name = '{efo_name}'\n",
    "    RETURN parent_efo._id AS efo_id, parent_efo._name AS efo_name\n",
    "\"\"\".format(\n",
    "    efo_id=efo_id, efo_name=efo_name\n",
    ")\n",
    "r = requests.post(f\"{epigraphdb_api_url}/cypher\", json={\"query\": query})\n",
    "r.raise_for_status()\n",
    "parent_df = pd.DataFrame(r.json()[\"results\"]).assign(node_type=\"parent\")\n",
    "ic(parent_df)\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH (n:Efo)-[r:EFO_CHILD_OF]->(child_efo:Efo)\n",
    "    WHERE n._id = '{efo_id}' AND n._name = '{efo_name}'\n",
    "    RETURN child_efo._id AS efo_id, child_efo._name AS efo_name\n",
    "\"\"\".format(\n",
    "    efo_id=efo_id, efo_name=efo_name\n",
    ")\n",
    "r = requests.post(f\"{epigraphdb_api_url}/cypher\", json={\"query\": query})\n",
    "r.raise_for_status()\n",
    "child_df = pd.DataFrame(r.json()[\"results\"]).assign(node_type=\"child\")\n",
    "\n",
    "efo_df = pd.concat(\n",
    "    [\n",
    "        pd.DataFrame([{\"efo_id\": efo_id, \"efo_name\": efo_name, \"node_type\": \"self\"}]),\n",
    "        parent_df,\n",
    "        child_df,\n",
    "    ]\n",
    ")\n",
    "efo_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "ic| r.json(): 0.439932479513145\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>efo_name</th>\n",
       "      <th>node_type</th>\n",
       "      <th>entity_term</th>\n",
       "      <th>cosine_sim</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>self</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hyperthyroidism</td>\n",
       "      <td>parent</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.690695</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Rare genetic thyroid disease</td>\n",
       "      <td>parent</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.729315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Familial gestational hyperthyroidism</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.674532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Familial hyperthyroidism due to mutations in T...</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.585188</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Generalized resistance to thyroid hormone</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.436534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Selective pituitary resistance to thyroid hormone</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.395431</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            efo_name node_type  \\\n",
       "0                               Rare hyperthyroidism      self   \n",
       "0                                    Hyperthyroidism    parent   \n",
       "1                       Rare genetic thyroid disease    parent   \n",
       "0               Familial gestational hyperthyroidism     child   \n",
       "1  Familial hyperthyroidism due to mutations in T...     child   \n",
       "2          Generalized resistance to thyroid hormone     child   \n",
       "3  Selective pituitary resistance to thyroid hormone     child   \n",
       "\n",
       "            entity_term  cosine_sim  \n",
       "0  Rare hyperthyroidism    1.000000  \n",
       "0  Rare hyperthyroidism    0.690695  \n",
       "1  Rare hyperthyroidism    0.729315  \n",
       "0  Rare hyperthyroidism    0.674532  \n",
       "1  Rare hyperthyroidism    0.585188  \n",
       "2  Rare hyperthyroidism    0.436534  \n",
       "3  Rare hyperthyroidism    0.395431  "
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get the cosine similarity between entity's embedding and embeddings of efo terms, by scispacy\n",
    "r = requests.get(\n",
    "    f\"{models_api_url}/nlp/similarity\", params={\"text1\": \"apple\", \"text2\": \"orange\"}\n",
    ")\n",
    "ic(r.json())\n",
    "\n",
    "semantic_sim_df = (\n",
    "    efo_df[[\"efo_name\", \"node_type\"]]\n",
    "    .assign(entity_term=entity_name)\n",
    "    .assign(\n",
    "        cosine_sim=lambda df: df.apply(\n",
    "            lambda row: requests.get(\n",
    "                f\"{models_api_url}/nlp/similarity\",\n",
    "                params={\"text1\": row[\"efo_name\"], \"text2\": row[\"entity_term\"]},\n",
    "            ).json(),\n",
    "            axis=1,\n",
    "        )\n",
    "    )\n",
    ")\n",
    "semantic_sim_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "ic| get_seq_cls_score(\n",
      "        text_1=[\"body weight\", \"coronary artery\"],\n",
      "        text_2=[\"body mass\", \"coronary heart disease\"],\n",
      "    ): [1.1656049489974976, 13.970565795898438]\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>efo_name</th>\n",
       "      <th>node_type</th>\n",
       "      <th>entity_term</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>self</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>-0.385750</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hyperthyroidism</td>\n",
       "      <td>parent</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>0.278737</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Rare genetic thyroid disease</td>\n",
       "      <td>parent</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>1.289101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Familial gestational hyperthyroidism</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>2.456133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Familial hyperthyroidism due to mutations in T...</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>2.451932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Generalized resistance to thyroid hormone</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>3.713221</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Selective pituitary resistance to thyroid hormone</td>\n",
       "      <td>child</td>\n",
       "      <td>Rare hyperthyroidism</td>\n",
       "      <td>3.945152</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            efo_name node_type  \\\n",
       "0                               Rare hyperthyroidism      self   \n",
       "0                                    Hyperthyroidism    parent   \n",
       "1                       Rare genetic thyroid disease    parent   \n",
       "0               Familial gestational hyperthyroidism     child   \n",
       "1  Familial hyperthyroidism due to mutations in T...     child   \n",
       "2          Generalized resistance to thyroid hormone     child   \n",
       "3  Selective pituitary resistance to thyroid hormone     child   \n",
       "\n",
       "            entity_term     score  \n",
       "0  Rare hyperthyroidism -0.385750  \n",
       "0  Rare hyperthyroidism  0.278737  \n",
       "1  Rare hyperthyroidism  1.289101  \n",
       "0  Rare hyperthyroidism  2.456133  \n",
       "1  Rare hyperthyroidism  2.451932  \n",
       "2  Rare hyperthyroidism  3.713221  \n",
       "3  Rare hyperthyroidism  3.945152  "
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# sequence classifier\n",
    "def get_seq_cls_score(text_1, text_2):\n",
    "    url = f\"{transformers_url}/inference\"\n",
    "    r = requests.post(url, json={\"text_1\": text_1, \"text_2\": text_2})\n",
    "    r.raise_for_status()\n",
    "    res = r.json()\n",
    "    return res\n",
    "\n",
    "\n",
    "ic(\n",
    "    get_seq_cls_score(\n",
    "        text_1=[\"body weight\", \"coronary artery\"],\n",
    "        text_2=[\"body mass\", \"coronary heart disease\"],\n",
    "    )\n",
    ")\n",
    "\n",
    "seq_cls_df = (\n",
    "    efo_df[[\"efo_name\", \"node_type\"]]\n",
    "    .assign(entity_term=entity_name)\n",
    "    .assign(\n",
    "        score=lambda df: get_seq_cls_score(\n",
    "            text_1=df[\"efo_name\"].tolist(), text_2=df[\"entity_term\"].tolist(),\n",
    "        )\n",
    "    )\n",
    ")\n",
    "seq_cls_df"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
